---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.Colors
source: html/20a8cea4-ea41-6389-905c-6475c613949e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.Colors Method

Get number of colors, including min, max and intermediate.

## Syntax (C#)
```csharp
public int Colors()
```

## Returns
Number of colors, including min, max and intermediate.